[{"id":1,"movieName":"Marvel Studios’ Black Widow ","movieInfo":"Telugu:<br> <iframe width=\"100%\" height=\"400\" src=\"https://www.youtube.com/embed/9K6FrJGZhms\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>","movieDescription":"Tamil:","movieImage":"https://3movierulz.vc/wp-content/uploads/2019/12/Black-Widow-Trailer.jpg","movieYear":2020,"movieLinks":[]},{"id":2,"movieName":"RDX Love ","movieInfo":"<iframe src=\"https://www.youtube.com/embed/9PpUtwaTBmU\" width=\"100%\" height=\"400\" frameborder=\"0\" allowfullscreen>&lt;span data-mce-type=\"bookmark\" style=\"display: inline-block; width: 0px; overflow: hidden; line-height: 0;\" class=\"mce_SELRES_start\"&gt;﻿&lt;/span&gt;</iframe>","movieDescription":"Details: Directed: Shankar Bhanu Stars: Tejus Kancherla, Paayal Rajput, Dr V.K. Naresh, Nagineedu, Adityamenon Dialogues: Parashuram Lyrics: Bhaskar Bhatla Editor: Prawin Pudi Choreographer: Ganesh Swamy Executive Producer: Chinna D.O.P: C Ram Prasad Music: Radhan Co-Producer: C V Rao Producer: C Kalyan","movieImage":"https://3movierulz.vc/wp-content/uploads/2019/09/RDX-Love-Trailer.jpg","movieYear":2019,"movieLinks":[]},{"id":3,"movieName":"Parker ","movieInfo":"Directed by: Taylor Hackford<br> Written by: John J. McLaughlin, Donald E. Westlake<br> Starring by: Jason Statham, Jennifer Lopez, Michael Chiklis<br> Genres: Action, Crime, Romance, Thriller<br> Country: USA<br> Language: Telugu","movieDescription":"Parker is a thief who has an unusual code. He doesn’t steal from the poor and hurt innocent people. He is asked to join four other guys on a job. They pull it off flawlessly. They tell Parker that what they got can help them set up another job which will net them much more. But Parker doesn’t want to join them and asks for his share. But they need it all so they try to kill him. They dispose of his body but someone finds him–he is still alive–and takes him to the hospital. After recovering he sets out to get back at the ones who tried to kill him, another one of his codes. Despite being told that they are working for a known mobster which he was not aware of, he still wants to go after them.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/10/Parker-Telugu-Poster.jpg","movieYear":2013,"movieLinks":[{"movieLink":"https://goscr.co/?p=26605"},{"movieLink":"https://embedsr.co/?p=20339"},{"movieLink":"https://streamango.com/f/relercktlrpsettl/"},{"movieLink":"https://embedrip.co/?p=12578"},{"movieLink":"https://oneload.site/srsmxf2knknn"},{"movieLink":"https://oload.cc/f/NJe273wfMTw/"},{"movieLink":"https://vidoza.net/xq86ttd1hohz.html"}]},{"id":4,"movieName":"Anthaku Minchi ","movieInfo":"Directed by: Jhony<br> Starring by: Rashmi Gautham, Jai, Ravi Prakaash, Ajaygosh<br> Genres: Horror, Romance<br> Country: India<br> Language: Telugu","movieDescription":"Raju(Jai) is a happy-go-lucky guy who dreams of becoming a millionaire. He comes to know that he can earn 5 crores if he manages to prove the existence of supernatural forces. He sets all his focus on finding a ghostly creature and to his surprise, he notices some weird happenings in his sister’s house and strongly believes that he found what he has been looking for. In this process, Priya(Rashmi) meets Raju and denies all his claims regarding the existence of any such unearthly force.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/10/Anthaku-Minchi-Image.jpg","movieYear":2018,"movieLinks":[{"movieLink":"https://goscr.co/?p=26277"},{"movieLink":"https://embedsr.co/?p=20116"},{"movieLink":"https://streamango.com/f/klerbbmkkkbsppqt/"},{"movieLink":"https://embedrip.co/?p=12553"},{"movieLink":"https://oneload.site/5ssjwqv5wwzi"},{"movieLink":"https://oload.cc/f/s3GwThHpBiE/"},{"movieLink":"https://vidoza.net/1h90faqk4c1c.html"}]},{"id":5,"movieName":"The Woman in Black ","movieInfo":"Directed by: James Watkins<br> Written by: Susan Hill (novel), Jane Goldman (screenplay)<br> Starring by: Daniel Radcliffe, Janet McTeer, Ciarán Hinds<br> Genres: Drama, Fantasy, Horror, Thriller<br> Country: UK, Canada, Sweden<br> Language: Telugu","movieDescription":"In London, solicitor Arthur Kipps still grieves the death of his beloved wife Stella on the delivery of their son Joseph four years ago. His employer gives him a last chance to keep his job, and he is assigned to travel to the remote village of Cryphin Gifford to examine the documentation of the Eel Marsh House that belonged to the recently deceased Mrs. Drablow. Arthur befriends Daily on the train and the man offers a ride to him to the Gifford Arms inn. Arthur has a cold reception and the owner of the inn tells that he did not receive the request of reservation and there is no available room.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/10/The-Woman-in-Black-Telugu-Poster.jpg","movieYear":2012,"movieLinks":[{"movieLink":"https://goscr.co/?p=26222"},{"movieLink":"https://embedsr.co/?p=20089"},{"movieLink":"https://streamango.com/f/mafprnmkaokbdrle/"},{"movieLink":"https://embedrip.co/?p=12547"},{"movieLink":"https://oneload.site/6tcncicb6u0l"},{"movieLink":"https://oload.cc/f/48sRp_fG5GM/"},{"movieLink":"https://vidoza.net/vk94mtkz43wo.html"}]},{"id":6,"movieName":"TRON: Legacy ","movieInfo":"Directed by: Joseph Kosinski<br> Written by: Edward Kitsis, Adam Horowitz<br> Stars: Jeff Bridges, Garrett Hedlund, Olivia Wilde<br> Genres: Action, Adventure, Fantasy, Sci-Fi<br> Country: USA<br> Language: Telugu","movieDescription":"Sam Flynn, the tech-savvy 27-year-old son of Kevin Flynn, looks into his father’s disappearance and finds himself pulled into the same world of fierce programs and gladiatorial games where his father has been living for 20 years. Along with Kevin’s loyal confidant Quorra, father and son embark on a life-and-death journey across a visually-stunning cyber universe that has become far more advanced and exceedingly dangerous. Meanwhile, the malevolent program CLU, who dominates the digital world, plans to invade the real world and will stop at nothing to prevent their escape.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/10/TRON-Legacy-Telugu-Poster.jpg","movieYear":2010,"movieLinks":[{"movieLink":"https://goscr.co/?p=26215"},{"movieLink":"https://embedsr.co/?p=20084"},{"movieLink":"https://streamango.com/f/ranpktcqnrcnsnbn/"},{"movieLink":"https://embedrip.co/?p=12544"},{"movieLink":"https://oneload.site/xyusr1urm5p2"},{"movieLink":"https://oload.cc/f/i3WpBc_D9SU/"},{"movieLink":"https://vidoza.net/5wccbymqwppn.html"}]},{"id":7,"movieName":"Gods of Egypt ","movieInfo":"Directed by: Alex Proyas<br> Written by: Matt Sazama, Burk Sharpless<br> Starring by: Brenton Thwaites, Nikolaj Coster-Waldau, Gerard Butler<br> Genres: Action, Adventure, Fantasy<br> Country: USA<br> Language: Telugu","movieDescription":"Set, the merciless god of darkness, has taken over the throne of Egypt and plunged the once peaceful and prosperous empire into chaos and conflict. Few dare to rebel against him. A young thief, whose love was taken captive by the god, seeks to dethrone and defeat Set with the aid of the powerful god Horus.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/10/Gods-of-Egypt-Telugu-New-Poster.jpg","movieYear":2016,"movieLinks":[{"movieLink":"https://goscr.co/?p=26052"},{"movieLink":"https://embedsr.co/?p=20007"},{"movieLink":"https://streamango.com/f/bonbstdqlmecpfft/"},{"movieLink":"https://embedrip.co/?p=12516"},{"movieLink":"https://oneload.site/1672u6jhathn"},{"movieLink":"https://oload.cc/f/F6FYJ3W_ERA/"},{"movieLink":"https://vidoza.net/4e21589s0gth.html"}]},{"id":8,"movieName":"Andala Rakshasi ","movieInfo":"Directed and written by: Hanumantha Rao Raghavapudi<br> Starring by: Naveen Chandra, Rahul Ravindran, Lavanya Tripathi<br> Genres: Romance<br> Country: India<br> Language: Telugu","movieDescription":"Andhala Rakshasi is set during the innocent days of 1991. It is Center-staged on three pure hearts Surya, Gowtham and Midhuna and is about falling in love, forgetting and waiting for love. The story celebrates love as well as exposes its dark side of tormenting its patrons in pursuit of it. The three characters resemble the three celestial bodies Sun, moon and Earth. Set in motion by the force of love, the three individuals can neither come close nor cut off but are destined to revolve around the dear ones. In this pursuit of pure love they will be thrown to destinies that they never imagined.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/10/Andala-Rakshasi-Poster.jpg","movieYear":2012,"movieLinks":[{"movieLink":"https://goscr.org/?p=25438"},{"movieLink":"https://embedsr.org/?p=19557"},{"movieLink":"https://streamango.com/f/lcamctndbaaoqskr/"},{"movieLink":"https://embedrip.org/?p=12394"},{"movieLink":"https://oneload.site/kj567hsp40b7"},{"movieLink":"https://oload.cloud/f/m_ijHwXljhU/"},{"movieLink":"https://vidoza.net/norizhalsfhs.html"}]},{"id":9,"movieName":"Anacondas: The Hunt for the Blood Orchid ","movieInfo":"Directed by: Dwight H. Little<br> Written by: Hans Bauer, Jim Cash<br> Starring by: Morris Chestnut, KaDee Strickland, Eugene Byrd<br> Genres: Action, Adventure, Horror, Thriller<br> Country: USA<br> Language: Telugu","movieDescription":"In New York, the ambitious Dr. Jack Byron and his associate Gordon Mitchell present the research of his assistant Sam Rogers to the CEO and board of directors of a corporation to sponsor a scientific expedition to Borneo. The objective is to find a flower, Blood Orchid, that flourishes for a couple of weeks every seven years and could be a fountain of youth, prolonging the expectation of life of human beings. They are succeeded and once in Borneo, they realize that it is the raining season and there is no boat available to navigate on the river.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/10/Anaconda-2-Telugu-Poster.jpg","movieYear":2004,"movieLinks":[{"movieLink":"https://goscr.org/?p=25143"},{"movieLink":"https://embedsr.org/?p=19369"},{"movieLink":"https://streamango.com/f/abdmrqqcbbcqsbdd/"},{"movieLink":"https://embedrip.org/?p=12348"},{"movieLink":"https://oneload.site/lkn8t92iuvri"},{"movieLink":"https://oload.cloud/f/bpnqTr71V3E/"},{"movieLink":"https://vidoza.net/ee4gcf6wgd8h.html"}]},{"id":10,"movieName":"Anaconda ","movieInfo":"Directed by: Luis Llosa<br> Written by: Hans Bauer, Jim Cash<br> Starring by: Jon Voight, Jennifer Lopez, Eric Stoltz<br> Genres: Action, Adventure, Horror, Thriller<br> Country: USA<br> Language: Telugu","movieDescription":"When a documentary crew traveling through the Amazon jungle, picks up a stranded man, they are unaware of the trouble that will occur. This stranger’s hobby is to capture the giant Anaconda snake, and plans to continue targeting it on their boat, by any means necessary.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/10/Anaconda-Telugu-Poster.jpg","movieYear":1997,"movieLinks":[{"movieLink":"https://goscr.org/?p=25112"},{"movieLink":"https://embedsr.org/?p=19352"},{"movieLink":"https://streamango.com/f/ttrfqmeldnlooqck/"},{"movieLink":"https://embedrip.org/?p=12333"},{"movieLink":"https://oneload.site/yt2qq18k88l1"},{"movieLink":"https://oload.cloud/f/fdbooQBwSYQ/"},{"movieLink":"https://vidoza.net/jlq57z6i02yu.html"}]},{"id":11,"movieName":"Divya Mani ","movieInfo":"Directed and written by: Giridhar Gopal<br> Starring by: Vaishali Deepak, Suresh Kamal, Sayaji Shinde<br> Genres: Action<br> Country: India<br> Language: Telugu","movieDescription":"Divya Mani is a action Telugu film released 2018. Written and directed by Giridhar Gopal and Suresh Kamal and Vaishali Deepak play as lead in the film.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/09/Divya-Mani-Poster.jpg","movieYear":2018,"movieLinks":[{"movieLink":"https://goscr.org/?p=24650"},{"movieLink":"https://embedsr.org/?p=19041"},{"movieLink":"https://streamango.com/f/nomfpfdrebfpoqpo/"},{"movieLink":"https://embedrip.org/?p=12270"},{"movieLink":"https://oneload.site/t1m5clp1200w"},{"movieLink":"https://oload.cloud/f/vAin_cEEhHk/"},{"movieLink":"https://vidoza.net/s3q0ol7szg2d.html"}]},{"id":12,"movieName":"Sanjeevani ","movieInfo":"Directed by: Ravi Vide<br> Starring : Anurag Dev, Swetaa Varma, Manoj Chandra<br> Genres: Adventure, Thriller<br> Country: India<br> Language: Telugu","movieDescription":"Sanjeevini’s story is all about a group of mountaineers who get an offer from the Indian government to trace the hidden secrets behind an undiscovered mountain in a valley. Accepting the challenge, the group start their adventure trip to the mysterious mountain.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/09/Sanjeevani-Telugu-Poster.jpg","movieYear":2018,"movieLinks":[{"movieLink":"https://goscr.org/?p=24638"},{"movieLink":"https://embedsr.org/?p=19035"},{"movieLink":"https://streamango.com/f/arcoafapbcnmsbno/"},{"movieLink":"https://embedrip.org/?p=12264"},{"movieLink":"https://oneload.site/ol957z56we1f"},{"movieLink":"https://oload.cloud/f/RULUydFb5F4/"},{"movieLink":"https://vidoza.net/4cf844kle722.html"}]},{"id":13,"movieName":"G-Force ","movieInfo":"Directed by: Hoyt Yeatman<br> Written by: Cormac Wibberley<br> Starring by: Will Arnett, Penélope Cruz, Zach Galifianakis<br> Genres: Animation, Action, Adventure, Comedy, Family, Fantasy, Sci-Fi<br> Country: USA<br> Language: Telugu","movieDescription":"The story is about a team of trained secret agent flies and a mole that takes on a mission for the US government. A specially trained squad of not guinea pigs is dispatched to stop a diabolical billionaire, who plans to taking over the world with household appliances.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/09/G-Force-Telugu-Poster.jpg","movieYear":2009,"movieLinks":[{"movieLink":"https://goscr.org/?p=24429"},{"movieLink":"https://embedsr.org/?p=18925"},{"movieLink":"https://streamango.com/f/npmaepfkadecqord/"},{"movieLink":"https://embedrip.org/?p=12230"},{"movieLink":"https://oneload.site/kapxd10acmcy"},{"movieLink":"https://oload.cloud/f/6lHD_zuUg1Q/"},{"movieLink":"https://vidoza.net/x4zl64t96mw7.html"}]},{"id":14,"movieName":"Four Warriors ","movieInfo":"Directed by: Phil Hawkins<br> Written by: Christopher Dane<br> Starring by: Christopher Dane, Hadrian Howard, Fergal Coghlan<br> Genres: Adventure<br> Country: USA, UK<br> Language: Telugu","movieDescription":"Three soldiers, along with their muslim captive, are making their way home through England after fighting in the Crusades. On their journey, they come across a village in need of their help. Almost all the children and all of the men from the village have been taken by the darkness in the woods surrounding the village, leaving the female villagers to defend the only child left, Dimitri.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/09/Four-Warriors-New-Telugu-Image.jpg","movieYear":2015,"movieLinks":[{"movieLink":"https://goscr.org/?p=24019"},{"movieLink":"https://embedsr.org/?p=18594"},{"movieLink":"https://streamango.com/f/kracecrkdbabmkbt/"},{"movieLink":"https://embedrip.org/?p=12152"},{"movieLink":"https://oneload.site/17voxv7w3hif"},{"movieLink":"https://oload.cloud/f/XTHrDRqZoTE/"},{"movieLink":"https://vidoza.net/wlu6vjha71ny.html"}]},{"id":15,"movieName":"Furious 7 ","movieInfo":"Directed by: James Wan<br> Written by: Chris Morgan, Gary Scott Thompson<br> Starring by: Vin Diesel, Paul Walker, Dwayne Johnson<br> Genres: Action, Crime, Thriller<br> Country: USA<br> Language: Telugu","movieDescription":"Dominic and his crew thought they’d left the criminal mercenary life behind. They’d defeated international terrorist Owen Shaw and went their separate ways. But now, Shaw’s brother, Deckard Shaw, is out killing the crew one by one for revenge. Worse, a Somalian terrorist called Jakarde and a shady government official called “Mr. Nobody” are both competing to steal a computer terrorism program called “God’s Eye,” that can turn any technological device into a weapon. Torretto must reconvene with his team to stop Shaw and retrieve the God’s Eye program while caught in a power struggle between the terrorist and the United States government.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/09/Furious-7-Telugu-New-BD-Image.jpg","movieYear":2015,"movieLinks":[{"movieLink":"https://goscr.org/?p=23911"},{"movieLink":"https://embedsr.org/?p=18499"},{"movieLink":"https://streamango.com/f/bceolqftrfeblktn/"},{"movieLink":"https://embedrip.org/?p=12139"},{"movieLink":"https://oneload.site/g6i4unk7p8eq"},{"movieLink":"https://oload.cloud/f/Z5efw45ItBc/"},{"movieLink":"https://vidoza.net/y6fomazsu1uh.html"}]},{"id":16,"movieName":"The Fate of the Furious ","movieInfo":"Directed by: F. Gary Gray<br> Written by: Gary Scott Thompson, Chris Morgan<br> Starring by: Vin Diesel, Jason Statham, Dwayne Johnson<br> Genres: Action, Crime, Thriller<br> Country: China, USA, Japan<br> Language: Telugu","movieDescription":"Now that Dom and Letty are on their honeymoon and Brian and Mia have retired from the game-and the rest of the crew has been exonerated-the globetrotting team has found a semblance of a normal life. But when a mysterious woman seduces Dom into the world of crime he can’t seem to escape and a betrayal of those closest to him, they will face trials that will test them as never before. From the shores of Cuba and the streets of New York City to the icy plains off the arctic Barents Sea, the elite force will crisscross the globe to stop an anarchist from unleashing chaos on the world’s stage… and to bring home the man who made them a family.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/09/The-Fate-of-the-Furious-New-Telugu-BDRip-Image.jpg","movieYear":2017,"movieLinks":[{"movieLink":"https://goscr.org/?p=23881"},{"movieLink":"https://embedsr.org/?p=18471"},{"movieLink":"https://streamango.com/f/ktdrqnttfprdstso/"},{"movieLink":"https://embedrip.org/?p=12136"},{"movieLink":"https://oneload.site/8vjvfr9wovjv"},{"movieLink":"https://oload.cloud/f/x3sF7IyZVHc/"},{"movieLink":"https://vidoza.net/ptweg1q5mvik.html"}]},{"id":17,"movieName":"Arya ","movieInfo":"Directed and written byby: Sukumar<br> Starring by: Allu Arjun, Anuradha Mehta, Siva Balaji<br> Genres: Action, Drama, Romance<br> Country: India<br> Language: Telugu","movieDescription":"Geetanjali a.k.a. Geetha (Anuradha Mehta), a college student, goes to Kanyakumari on a trip. She finds a poem in a diary left on a beach and signs in it, saying that she wishes the poet will succeed in his love. Later on, her anklet falls into the ocean and a guy jumps into the water in front of her eyes but no one sees him resurfacing. However, Geetha did not see who jumped in the ocean. She dreams about the incident frequently with the idea that the guy who jumped has died but her friends ask her to forget it.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/09/Arya-Telugu-Image.jpg","movieYear":2004,"movieLinks":[{"movieLink":"https://goscr.org/?p=23869"},{"movieLink":"https://embedsr.org/?p=18459"},{"movieLink":"https://streamango.com/f/frlrnmeppncoqkbk/"},{"movieLink":"https://embedrip.org/?p=12132"},{"movieLink":"https://oneload.site/uvejiz0lpop2"},{"movieLink":"https://oload.cloud/f/Ytopx3n0llQ/"},{"movieLink":"https://vidoza.net/12pnfgsi3oef.html"}]},{"id":18,"movieName":"Beyond the Call to Duty ","movieInfo":"Directed and written by: Aleksandar Ivicic<br> Starring by: Kevin Tanski, Robert Woodley, Chris Clark<br> Genres: Action, Drama, Sci-Fi, Thriller, War<br> Country: USA<br> Language: Telugu","movieDescription":"Five Spec Ops, Alpha Squad, head a simple Recon Mission that turns into an all out war for survival against a wave of undead experiments. Alpha Squad must fight, not just for the sake of their own survival, but the fate of the world.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/09/Beyond-the-Call-to-Duty-Telugu-Movie-Poster.jpg","movieYear":2016,"movieLinks":[{"movieLink":"https://goscr.org/?p=23793"},{"movieLink":"https://embedsr.org/?p=18393"},{"movieLink":"https://streamango.com/f/kkcekrnrlaldqeop/"},{"movieLink":"https://embedrip.org/?p=12123"},{"movieLink":"https://oneload.site/aokstdgepqh6"},{"movieLink":"https://oload.cloud/f/Zkv93M8F7xs/"},{"movieLink":"https://vidoza.net/qycuo9srd2f0.html"}]}]