[{"id":1,"movieName":"Marvel Studios’ Black Widow ","movieInfo":"Telugu:<br> <iframe width=\"100%\" height=\"400\" src=\"https://www.youtube.com/embed/9K6FrJGZhms\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>","movieDescription":"Tamil:","movieImage":"https://3movierulz.vc/wp-content/uploads/2019/12/Black-Widow-Trailer.jpg","movieYear":2020,"movieLinks":[]},{"id":2,"movieName":"RDX Love ","movieInfo":"<iframe src=\"https://www.youtube.com/embed/9PpUtwaTBmU\" width=\"100%\" height=\"400\" frameborder=\"0\" allowfullscreen>&lt;span data-mce-type=\"bookmark\" style=\"display: inline-block; width: 0px; overflow: hidden; line-height: 0;\" class=\"mce_SELRES_start\"&gt;﻿&lt;/span&gt;</iframe>","movieDescription":"Details: Directed: Shankar Bhanu Stars: Tejus Kancherla, Paayal Rajput, Dr V.K. Naresh, Nagineedu, Adityamenon Dialogues: Parashuram Lyrics: Bhaskar Bhatla Editor: Prawin Pudi Choreographer: Ganesh Swamy Executive Producer: Chinna D.O.P: C Ram Prasad Music: Radhan Co-Producer: C V Rao Producer: C Kalyan","movieImage":"https://3movierulz.vc/wp-content/uploads/2019/09/RDX-Love-Trailer.jpg","movieYear":2019,"movieLinks":[]},{"id":3,"movieName":"ABCD ","movieInfo":"Directed by: Remo<br> Written by: Amit Aryan, Tushar Hiranandani<br> Starring by: Prabhudheva, Ganesh Acharya, Kay Kay Menon<br> Genres: Drama, Musical<br> Country: India<br> Language: Hindi","movieDescription":"For Vishnu (Prabhudheva), widely regarded as India’s best dancer, dance is more than a passion – it’s the reason he lives! So when he finds himself thrown out from the swish dance academy he himself set up, by his manipulative business partner, it feels like the oxygen has been sucked out from the air he breathes. Heart-broken, Vishnu decides to give up dance and leave Mumbai forever. However the night before his departure he witnesses a most amazing sight – a group of dancers preparing for the upcoming Ganpati Dance Battle – an annual festival that pits Mumbai’s best dance groups against each other.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/05/ABCD-Telugu-Poster.jpg","movieYear":null,"movieLinks":[{"movieLink":"http://escr.to/?p=9054"},{"movieLink":"http://esr.to/?p=8298"},{"movieLink":"https://streamango.com/f/arfofrscbstsrdao/"},{"movieLink":"http://embedrip.to/?p=7709"},{"movieLink":"https://oneload.co/rp6f6881qafh"},{"movieLink":"https://estream.to/ftjd6exwg7nt.html"},{"movieLink":"https://oload.win/f/E5VYQyde9zA/"},{"movieLink":"https://vidzi.tv/ueqs9pao349e.html"}]},{"id":4,"movieName":"Dandupalyam 3 ","movieInfo":"Directed by: Srinivasaraj<br> Starring by: Pooja Gandhi, Ravishankar P, Makrand Deshpande<br> Genres: Crime, Thriller<br> Country: India<br> Language: Telugu","movieDescription":"The film traces the origins of the gang and how the members chanced upon their modus operandi. These ganja smoking, pork eating criminals are shown to be nothing short of beasts, and that is why there is an officer who wants to hunt them down and put them behind bars, come what may and by whatever means possible.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/05/Dandupalyam-3-Image.jpg","movieYear":2018,"movieLinks":[{"movieLink":"http://escr.to/?p=9116"},{"movieLink":"http://esr.to/?p=8333"},{"movieLink":"https://streamango.com/f/sdmroecfftmtqsmf/"},{"movieLink":"http://embedrip.to/?p=7741"},{"movieLink":"https://oneload.co/7rdgoobjdfu6"},{"movieLink":"https://estream.to/x8na7k0veac4.html"},{"movieLink":"https://oload.win/f/dnelir5cT6w/"},{"movieLink":"https://vidzi.tv/p39bc6956r6l.html"}]},{"id":5,"movieName":"Avunu 2 ","movieInfo":"Directed by: Ravi Babu<br> Starring by: Harshvardhan Rane, Poorna, Sanjana<br> Genres: Horror<br> Country: India<br> Language: Telugu","movieDescription":"The lustful spirit of Captain Raju stalks Mohini till the end in this continuation of the first part. A true part 2 in the sense that the second part picks up from exactly the same shot from where the first part ended.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/04/Avunu-2-New-Image.jpg","movieYear":2015,"movieLinks":[{"movieLink":"http://escr.to/?p=8890"},{"movieLink":"http://esr.to/?p=8158"},{"movieLink":"https://streamango.com/f/lmpfmprsetroesoc/"},{"movieLink":"http://embedrip.to/?p=7656"},{"movieLink":"https://oneload.co/5igtcxjiu361"},{"movieLink":"https://estream.to/9rht6r73j4ml.html"},{"movieLink":"https://oload.win/f/6DmoVAj9FUw/"},{"movieLink":"https://vidzi.tv/q55saqilsvk2.html"}]},{"id":6,"movieName":"Beginners ","movieInfo":"Directed and written by: Mike Mills<br> Starring by: Ewan McGregor, Christopher Plummer, Mélanie Laurent<br> Genres: Comedy, Drama, Romance<br> Country: USA<br> Language: Telugu","movieDescription":"A young man is rocked by two announcements from his elderly father: that he has terminal cancer, and that he has a young male lover.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/04/Beginners-Telugu-Poster.jpg","movieYear":2010,"movieLinks":[{"movieLink":"http://escr.to/?p=8577"},{"movieLink":"https://oload.win/f/JnCbnS4sINA/"},{"movieLink":"https://streamango.com/f/podlkarqqeqtatfl/"},{"movieLink":"http://embedrip.to/?p=7540"},{"movieLink":"https://oneload.co/sea15i13tpnn"},{"movieLink":"https://estream.to/vc4k9suo9oy0.html"},{"movieLink":"https://vidzi.tv/uq42o0i6oc4q.html"}]},{"id":7,"movieName":"Ee Manase ","movieInfo":"Directed by: G Krishan Prasad<br> Starring by: Krishan, Deepika Das, Thagubothu Ramesh<br> Genres: Romance<br> Country: India<br> Language: Telugu","movieDescription":"Ee Manase is a telugu movie directed by G Krishan Prasad and cast Deepika Das, Thagubothu Ramesh, Suriya, Krishan is released in 2014.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/04/Ee-Manase-Poster.jpg","movieYear":2014,"movieLinks":[{"movieLink":"http://escr.to/?p=8538"},{"movieLink":"http://esr.to/?p=7796"},{"movieLink":"https://streamango.com/f/qedpcamssnpfccfk/"},{"movieLink":"http://embedrip.to/?p=7530"},{"movieLink":"https://oneload.co/g1m3a1ub1dgn"},{"movieLink":"https://estream.to/ba77ph1ks4lx.html"},{"movieLink":"https://oload.win/f/MmWRpQ2IZbM/"},{"movieLink":"https://vidzi.tv/n0hzjl7uuu3c.html"}]},{"id":8,"movieName":"Piranha 2 ","movieInfo":"Directed by: John Gulager<br> Written by: Patrick Melton, Marcus Dunstan<br> Starring by: Danielle Panabaker, Ving Rhames, David Hasselhoff<br> Genres: Comedy, Horror<br> Country: USA<br> Language: Telugu","movieDescription":"Having awoken from their spring break extravaganza at Lake Victoria, the swarm heads upstream where they look to make a meal out of Big Wet, a local water park where when it comes to fun, nobody does it wetter! Though they came to get wet, get loaded and get some, the staff and patrons get more than they bargained for when they must face the fiercest, most bloodthirsty piranhas yet. Lead by the strong-willed, studious Maddy and her friends, Barry and Kyle, the trio must dive in and take on these man-eating creatures using every ounce of their being but can they be stopped?","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/04/Piranha-2-Telugu-Poster.jpg","movieYear":2012,"movieLinks":[{"movieLink":"http://escr.to/?p=8511"},{"movieLink":"http://esr.to/?p=7770"},{"movieLink":"https://streamango.com/f/domsbmndacqndmqf/"},{"movieLink":"http://embedrip.to/?p=7524"},{"movieLink":"https://oneload.co/g20ys49rtljx"},{"movieLink":"https://estream.to/7o75xd4pa0ak.html"},{"movieLink":"https://oload.win/f/xIPPQ0JmEqw/"},{"movieLink":"https://vidzi.tv/krekr3zugbrz.html"}]},{"id":9,"movieName":"Hulk ","movieInfo":"Directed by: Ang Lee<br> Written by: Stan Lee, Jack Kirby<br> Starring by: Eric Bana, Jennifer Connelly, Sam Elliott<br> Genres: Action, Sci-Fi<br> Country: USA<br> Language: Telugu","movieDescription":"Bruce Banner, a genetics researcher with a tragic past, suffers an accident that causes him to transform into a raging green monster when he gets angry.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/04/Hulk-Telugu-Poster.jpg","movieYear":2003,"movieLinks":[{"movieLink":"http://escr.to/?p=8474"},{"movieLink":"http://esr.to/?p=7738"},{"movieLink":"https://streamango.com/f/cskblsfortrbofpl/"},{"movieLink":"http://embedrip.to/?p=7509"},{"movieLink":"https://oneload.co/riwcwyqyli17"},{"movieLink":"https://oload.win/f/IOwqcQtjSzE/"},{"movieLink":"https://vidzi.tv/qe1eucslqcin.html"}]},{"id":10,"movieName":"Oye! ","movieInfo":"Directed by: Anand Ranga<br> Written by: Simha Raja, Rajasimha<br> Starring by: Siddharth, Shamili, Ali<br> Genres: Romance<br> Country: India<br> Language: Telugu","movieDescription":"Uday (Siddharth) is a rich and spoilt brat who believes in short term pleasures. Sandhya (Shamili) is a loner who lives on her own. She is a responsible girl with long term plans and strict principles. Uday falls in love with Sandhya at the very first sight. And she joins her place as a paying guest. When everything is going well, Uday comes to know that Sandhya is suffering from cancer and her days are numbered. But Sandhya is not aware of it. The rest of the story is all about how Uday makes Sandhya realise all her unfulfilled wishes.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/04/Oye-Poster.jpg","movieYear":2009,"movieLinks":[{"movieLink":"http://escr.to/?p=8456"},{"movieLink":"http://esr.to/?p=7727"},{"movieLink":"https://streamango.com/f/qkaaofemctdqdddq/"},{"movieLink":"http://embedrip.to/?p=7503"},{"movieLink":"https://oneload.co/ay4o288sa7ee"},{"movieLink":"https://oload.win/f/G8SHG6-KPvY/"},{"movieLink":"https://vidzi.tv/l4bddxlo91ez.html"}]},{"id":11,"movieName":"All Is Lost ","movieInfo":"Directed and written by: J.C. Chandor<br> Staring by: Robert Redford<br> Genres: Action, Adventure, Drama<br> Country: USA<br> Language: Telugu","movieDescription":"Deep into a solo voyage in the Indian Ocean, an unnamed man (Redford) wakes to find his 39-foot yacht taking on water after a collision with a shipping container left floating on the high seas. With his navigation equipment and radio disabled, the man sails unknowingly into the path of a violent storm. Despite his success in patching the breached hull, his mariner’s intuition and a strength that belies his age, the man barely survives the tempest. Using only a sextant and nautical maps to chart his progress, he is forced to rely on ocean currents to carry him into a shipping lane in hopes of hailing a passing vessel. But with the sun unrelenting, sharks circling and his meager supplies dwindling, the ever-resourceful sailor soon finds himself staring his mortality in the face.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/04/All-Is-Lost-Telugu-Poster.jpg","movieYear":2013,"movieLinks":[{"movieLink":"http://escr.to/?p=8427"},{"movieLink":"http://esr.to/?p=7705"},{"movieLink":"https://streamango.com/f/olnqbkcqfdrnpnbp/"},{"movieLink":"http://embedrip.to/?p=7492"},{"movieLink":"https://oneload.co/b15dh7s5i4qb"},{"movieLink":"https://oload.win/f/2FNkGbmc3NM/"},{"movieLink":"https://vidzi.tv/4bhk5e03dmhu.html"}]},{"id":12,"movieName":"9 ","movieInfo":"Directed by: Shane Acker<br> Written by: Pamela Pettler, Shane Acker<br> Starring by: Elijah Wood, Jennifer Connelly, Crispin Glover<br> Genres: Animation, Action, Adventure, Family, Mystery, Sci-Fi, Thriller<br> Country: USA<br> Language: Telugu","movieDescription":"In a world destroyed in a war between man and machine, a hand-stitched doll with the number 9 written on its back comes to life. The world he has awakened in is frightening, but he quickly learns that he is not alone and that there are others like him, also with a single digit written on their back. The first one he encounters is 2 who tells him something of what happened to the world. 2 is also thrilled with the disk 9 is carrying, one with three unique symbols on the front. 9 soon learns that the disk and some of the other dolls who are prepared to die for the good of humankind may be the last hope for man’s salvation.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/04/9-Telugu-Image.jpg","movieYear":2009,"movieLinks":[{"movieLink":"http://escr.to/?p=8403"},{"movieLink":"http://esr.to/?p=7684"},{"movieLink":"https://streamango.com/f/lqsbtnmqttplkqno/"},{"movieLink":"http://embedrip.to/?p=7483"},{"movieLink":"https://oneload.co/me2f72tnub26"},{"movieLink":"https://oload.win/f/hKFsqssLn_c/"},{"movieLink":"https://vidzi.tv/9uwx682ji1sz.html"}]},{"id":13,"movieName":"London Boulevard ","movieInfo":"Directed by: William Monahan<br> Written by: William Monahan, Ken Bruen<br> Starring by: Colin Farrell, Keira Knightley, Ray Winstone<br> Genres: Crime, Drama<br> Country: USA, UK<br> Language: Telugu","movieDescription":"Fresh out of prison, Mitchel wants nothing to do with crime but accepts a kip from Billy, a marginal grafter, and accompanies Billy on rent collection trips. He’s also old school, wanting revenge on two youths for assaulting a mendicant he’s befriended. He’s got a strung-out sister to protect, and he’s offered a job protecting a famous actress from paparazzi. The plot lines join when Michael finds himself attracted to the actress and Billy’s Mob boss, Gant, finds ways to force Michael work for him. He also warns Michael off revenge against the assailants of his friend. What are Michael’s options: is there any way to avoid Gant, protect his sister, and find a path to love?","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/04/London-Boulevard-Telugu-Poster.jpg","movieYear":2010,"movieLinks":[{"movieLink":"http://escr.to/?p=8326"},{"movieLink":"http://esr.to/?p=7622"},{"movieLink":"https://streamango.com/f/slelnnsodcfdqtas/"},{"movieLink":"http://embedrip.to/?p=7466"},{"movieLink":"https://oneload.co/idsime6xudr1"},{"movieLink":"https://estream.to/qer78jlmxejz.html"},{"movieLink":"https://oload.win/f/j8jqY7BNfiU/"},{"movieLink":"https://vidzi.tv/qg5mznpfuy2l.html"}]},{"id":14,"movieName":"Being Flynn ","movieInfo":"Directed by: Paul Weitz<br> Written by: Paul Weitz, Nick Flynn<br> Starring by: Paul Dano, Robert De Niro, Julianne Moore<br> Genres: Drama<br> Country: USA<br> Language: Telugu","movieDescription":"Nick Flynn, in his 20s, hasn’t found his place in the world yet, but hopes to be a writer. Around the time he takes a job at a homeless shelter in Boston, his father, Jonathan, who considers himself a great writer and who hasn’t see Nick in years, abruptly makes fleeting contact. A few months later, the down-and-out Jonathan shows up at Nick’s shelter and becomes a resident. This disorients Nick; he doesn’t handle it well, compounded by Jonathan’s belligerent behavior. Nick’s memories of his mother, his budding relationship with a co-worker, and his own demons make things worse. Can anything improve? Is he his father’s son?","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/04/Being-Flynn-Telugu-Poster.jpg","movieYear":2012,"movieLinks":[{"movieLink":"http://escr.to/?p=8313"},{"movieLink":"http://esr.to/?p=7612"},{"movieLink":"https://streamango.com/f/ldfmtrotbmtfdebn/"},{"movieLink":"http://embedrip.to/?p=7459"},{"movieLink":"https://oneload.co/er4djnjdr39s"},{"movieLink":"https://estream.to/1j21b4wbf2po.html"},{"movieLink":"https://oload.win/f/9HN_5zEicog/"},{"movieLink":"https://vidzi.tv/pfeoui7exfeg.html"}]},{"id":15,"movieName":"Arya 2 ","movieInfo":"Directed by: Sukumar<br> Written by: Chandrasekhar T. Ramesh, Thota Srinivas<br> Starring by: Allu Arjun, Kajal Aggarwal, Navdeep<br> Genres: Action, Drama, Thriller<br> Country: India<br> Language: Telugu","movieDescription":"Ajay reflects on his friendship with Arya and recollects how he met him during their stay in an orphanage. Arya virtually forced himself upon him, even tattooed his name on his arm, and proclaimed to be his best friend – but ended up only embarrassing him. After Ajay gets adopted, he heaves a sigh of relief but Arya does re-enter his life as an adult when the former is the CEO of Aj’s Electronics. Ajay offers him a job conditionally that he behaves himself, and the latter undergoes a transformation and everyone believes that he is ‘Mr. Perfect’.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/04/Arya-2-Telugu-Poster.jpg","movieYear":2009,"movieLinks":[{"movieLink":"http://escr.to/?p=8201"},{"movieLink":"http://esr.to/?p=7533"},{"movieLink":"https://streamango.com/f/pklfobtbbrbepmrb/"},{"movieLink":"http://embedrip.to/?p=7422"},{"movieLink":"https://oneload.co/09epjb7cz240"},{"movieLink":"https://estream.to/hezuhg40q63k.html"},{"movieLink":"https://oload.win/f/pm-utLvC0cA/"},{"movieLink":"https://vidzi.tv/6x2rtitfmae6.html"}]},{"id":16,"movieName":"The Rum Diary ","movieInfo":"Directed by: Bruce Robinson<br> Written by: Bruce Robinson, Hunter S. Thompson<br> Starring by: Johnny Depp, Giovanni Ribisi, Aaron Eckhart<br> Genres: Comedy, Drama<br> Country: USA, UK<br> Language: Telugu","movieDescription":"Hard-drinking journalist Paul Kemp takes a job at a besieged newspaper in San Juan, Puerto Rico. His volatile editor, Lotterman, assigns him to tourist pieces and horoscopes, but promises more. Paul rooms with Sala, an aging and equally alcoholic reporter, in a rundown flat. Sanderson, a wealthy entrepreneur, hires Paul to flack for a group of investors who plan to buy an island near the capital and build a resort. Sanderson’s girl-friend, the beguiling Chenault, bats her eyes at Paul. His loyalties face challenges when he and Sala get in trouble with locals, when a Carnival dance enrages Sanderson, and when the paper hits the skids. Is the solution always alcohol?","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/04/The-Rum-Diary-Poster.jpg","movieYear":2011,"movieLinks":[{"movieLink":"http://escr.to/?p=8136"},{"movieLink":"http://esr.to/?p=7476"},{"movieLink":"https://streamango.com/f/lemqfpmecdosbobk/"},{"movieLink":"http://embedrip.to/?p=7399"},{"movieLink":"https://oneload.co/v1zin1n2edzf"},{"movieLink":"https://estream.to/bayg6m4n86av.html"},{"movieLink":"https://oload.win/f/hqkCpN-aPd0/"},{"movieLink":"https://vidzi.tv/s1hfy76krtn3.html"}]},{"id":17,"movieName":"Danny Collins ","movieInfo":"Directed and written by: Dan Fogelman<br> Starring by: Al Pacino, Annette Bening, Jennifer Garner<br> Genres: Comedy, Drama, Music<br> Country: USA<br> Language: English","movieDescription":"Inspired by a true story, Al Pacino stars as aging 1970s rocker Danny Collins, who can’t give up his hard-living ways. But when his manager (Christopher Plummer) uncovers a 40 year-old undelivered letter written to him by John Lennon, he decides to change course and embarks on a heartfelt journey to rediscover his family, find true love and begin a second act.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/04/Danny-Collins-Telugu-Image.jpg","movieYear":2015,"movieLinks":[{"movieLink":"http://escr.to/?p=8415"},{"movieLink":"http://esr.to/?p=7694"},{"movieLink":"https://streamango.com/f/sfreeelpqtpdnatk/"},{"movieLink":"http://embedrip.to/?p=7489"},{"movieLink":"https://oneload.co/qrdtvhb44wjb"},{"movieLink":"https://oload.win/f/MLL3Hbla1v8/"},{"movieLink":"https://vidzi.tv/jy7c8z2xw16b.html"}]},{"id":18,"movieName":"Star Wars VII: The Force Awakens ","movieInfo":"Directed by: J.J. Abrams<br> Written by: Lawrence Kasdan, J.J. Abrams<br> Starring by: Daisy Ridley, John Boyega, Oscar Isaac<br> Genres: Action, Adventure, Fantasy, Sci-Fi<br> Country: USA<br> Language: Telugu (India)","movieDescription":"Three decades after the Empire’s defeat, a new threat arises in the militant First Order. Stormtrooper defector Finn and the scavenger Rey are caught up in the Resistance’s search for the missing Luke Skywalker.","movieImage":"https://3movierulz.vc/wp-content/uploads/2018/04/Star-Wars-The-Force-Awakens-Telugu-Poster.jpg","movieYear":2015,"movieLinks":[{"movieLink":"http://escr.to/?p=8087"},{"movieLink":"http://esr.to/?p=7422"},{"movieLink":"https://streamango.com/f/sqfnrbeelcrltcan/"},{"movieLink":"http://embedrip.to/?p=7382"},{"movieLink":"https://oneload.co/2fehhj08aqmo"},{"movieLink":"https://estream.to/f13p9x92xcul.html"},{"movieLink":"https://oload.win/f/AvblpU1kOvk/"},{"movieLink":"https://vidzi.tv/m7enea42e636.html"}]}]